erpdev.СХК_Расширение/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb25b6bc-7f7a-447b-8658-e8893ac87128">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="43c7d80b-bd8e-4151-b0e1-084444292845">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="448beea5-fe0e-4558-b386-88fdde891a35">
    <name>ПроизводительВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="811ed59d-1e61-4b9f-b4fb-3b5dc1e65b8c">
    <name>RFIDUser</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf11029-162c-49c8-b54b-767bda8ca180">
    <name>СерияНоменклатурыДляЦенообразования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80a89a7f-1fed-4811-b40c-3a5ab50662a9">
    <name>RFIDTID</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0c1efe6-bb2e-4ed3-80a8-cab3c7e1b456">
    <name>RFIDEPC</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6dd6eb6e-b1b8-4da9-9b97-35f41594d1d6">
    <name>EPCGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50ccfd5f-e7cd-4e00-a6ee-2b31c3198df5">
    <name>RFIDМеткаНеЧитаемая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ebda52-1b95-4474-a953-08ea8d771161">
    <name>НомерКиЗГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b41bc339-8059-4e1b-a18e-9b2d19e4c2e1">
    <name>ПроизводительЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0031dd3e-8675-47e2-ae98-c7e7a9b2060a">
    <name>ИдентификаторПартииВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f266e93e-196b-4c32-867c-1eb7dcc148b4">
    <name>Справка2ЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888c0446-d41f-43e2-9d71-c2abeb77ef11">
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff2d5643-26e8-40ec-b266-8fb17cd78983">
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Catalogs/СерииНоменклатуры/ObjectModule.bsl
&Вместо("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);

	УстановитьРеквизитыЦенообразования = Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИспользуетсяЦенообразование25", УстановитьРеквизитыЦенообразования) Тогда
		УстановитьРеквизитыЦенообразования =	ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
		Если Не Реквизит.Использование Тогда
			ЭтотОбъект[Реквизит.ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Номер = СокрЛП(Номер);
	
	Если НастройкиИспользованияСерий.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ГоденДо = НачалоЧаса(ГоденДо);
	ИначеЕсли НастройкиИспользованияСерий.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ГоденДо = НачалоМесяца(ГоденДо);
	Иначе
		ГоденДо = НачалоДня(ГоденДо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиИспользованияСерий.ШаблонРабочегоНаименованияСерии) Тогда
		Наименование = НоменклатураСервер.НаименованиеПоШаблону(НастройкиИспользованияСерий.ШаблонРабочегоНаименованияСерии, ЭтотОбъект);
	Иначе
		
		Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая продукция: Батончики") Тогда
			
		Иначе
			Наименование = НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиКлючаЦен = НастройкиИспользованияСерий.НастройкиКлючаЦенПоСерии;
	Если УстановитьРеквизитыЦенообразования 
		И ЗначениеЗаполнено(НастройкиКлючаЦен)
		И НастройкиКлючаЦен <> Перечисления.ВариантОтбораДляКлючаЦен.НеИспользовать Тогда
			
		ОбновлениеНастроекЦенообразованияВидыНоменклатуры = Ложь;
		Если Не ДополнительныеСвойства.Свойство("ОбновлениеНастроекЦенообразованияВидыНоменклатуры", ОбновлениеНастроекЦенообразованияВидыНоменклатуры) Тогда
			ОбновлениеНастроекЦенообразованияВидыНоменклатуры = Ложь;
		КонецЕсли;
		
		ПроизвестиПоискХСО = ОбновлениеНастроекЦенообразованияВидыНоменклатуры;
		Если Не ОбновлениеНастроекЦенообразованияВидыНоменклатуры Тогда
			Если НастройкиКлючаЦен = Перечисления.ВариантОтбораДляКлючаЦен.ИспользоватьПоРеквизитам Тогда
				ПроизвестиПоискХСО = Истина;
			ИначеЕсли НастройкиКлючаЦен = Перечисления.ВариантОтбораДляКлючаЦен.Использовать Тогда
				ПроизвестиПоискХСО = Ложь;
			КонецЕсли;
		КонецЕсли;

		РеквизитыДляПоиска = ПолучитьРеквизитыДляПоиска(ВидНоменклатуры, НастройкиИспользованияСерий, ПроизвестиПоискХСО);
		СерияНоменклатурыДляЦенообразования = Справочники.СерииНоменклатурыДляЦенообразования.ПолучитьСериюНоменклатурыДляЦенообразования(РеквизитыДляПоиска);
		
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());

КонецПроцедуры
